
# * เป็นนักวิศวกรคอมพิวเตอร์ ต้องมั่นศึกษาสิ่งใหม่ ๆ ~

REQUIRED_KEY = ["ansYes", "ansNo"]

#! งานใหญ่มาก ๆ สู้ ๆ น้าาาาา


def getValidLangs() -> list():
    # TODO : คำสั่งนี้จะเป็นคำสั่งในการอ่านไฟล์ต่าง ๆ ที่อยู่ในแฟ้ม lang โดยไฟล์แต่ละไฟล์จะอยู่ในรูป yaml
    # TODO : จากนั้นให้เช็คว่ามีคีย์ตาม REQUIRED_KEY ครบหรือไม่ ให้ส่งค่าออกมาเป็น list

    # * เพราะงานใหญ่และยากมาก จึงแนะนำให้ทำเป็นพาท ๆ แบบนี้(จะไม่ทำตามก็ได้ แค่แนะนำ)
    # ? 1.หาคำสั่งที่ใช้ในการดูว่าแฟ้มนี้มีโฟลเดอร์อะไรบ้าง (ใบ้ว่าใช้ os.listdir()) ถ้าเป็นไปได้ ให้กรองเหลือแต่ไฟล์ .yml
    # ? 2.ให้ไปศึกษาว่าไฟล์ yaml คืออะไร แต่ถ้าง่าย ๆ มันก็คือการ dump ข้อมูลมาเป็นไฟล์ (คล้าย ๆ json)
    # ?   แต่ส่วนตัวคิดว่าสวยกว่า json
    # * เช่น { 'A' : [1, 2, 3, 4, 5] , 'B' : [6, 7, 8, 9, 10]} จะออกมาเป็น
    """
        A:
        - 1
        - 2
        - 3
        - 4
        - 5

        B:
        - 6
        - 7
        - 8
        - 9
        - 10
        #สวยกว่า json เยอะ
    """
    # ?   กูไม่ได้ต้องการให้มึงเขียนโปรแกรมแปลงข้อมูลตัวแปร ไปเป็น yaml (เพราะมันยากจัด)
    # ?   แต่ให้ใช้คำสั่งที่มีคนเขียนแล้ว
    # ?   ให้ลองศึกษา pyyaml ทั้งเรื่องการลงไลบรารี่ จนถึงการใช้งาน ว่ามันใช้ยังไง?

    # ? 3.ถ้าเข้าถึงไฟล์ ก็ลองหาวิธีเช็คเอาว่าไฟล์นี้ว่ามีคีย์ตาม REQUIRED_KEY ครบหรือไม่
    # ?   ถ้าครบก็ใส่ใน list แล้วให้ส่งค่าออกมาเป็น list

    # * ตัวอย่าง
    """#TH.yml
        ansYes:
            - ใช่
            - ช่าย
            - ใช้แล้ว
        ansNo:
            - ไม่ใช่
            - ไม่
    """
    """#EN.yml
        ansYes:
            - Yes
            - yyes
            - yyyes
        ansNo:
            - no
    """
    """#JA.yml
        ansYes:
            - はい
        ansNo:
            - いいえ
    """
    """#TH2.yml
        ansYes:
            - ค ว ย
    """
    """#Swa.ini
        ansYes:
            - swa
        ansNo:
            - Swa
    """
    # * Return -> ["TH.yml", "EN.yml", "JA.yml"]
    #! TH2 ไม่ใช่เพราะ ไม่มี ansNo
    #! Swa ไม่ใช่เพราะ ไม่ใช่ไฟล์ ini

    #! ยากละสิ
    #! แนะนำว่าค่อย ๆ ทำ
    #! จะเขียนฟังก์ชั่นเพิ่มก็ไม่ว่า ถ้ามันมีประโชน์ต่อชีวิต
    #! REQUIRED_KEY ในอนาคตจะมีเยอะกว่านี้มาก ๆ (จะไม่ได้มีแค่ 2 อัน)
    pass
